---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorOptions.CustomAxis
source: html/3ecd9cd1-d9c9-025d-af65-10f6f20ee309.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorOptions.CustomAxis Property

The custom axis to try (if extrusionAxes includes an option for a custom direction).

## Syntax (C#)
```csharp
public XYZ CustomAxis { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null